read_verilog hdl/smart_pe.v
read_verilog hdl/systolic_array_4x4.v
read_verilog hdl/data_skewer.v
read_verilog hdl/top_accelerator.v

hierarchy -check -top top_accelerator

proc;      
opt;       
fsm;       
opt;       

techmap; 
opt;

abc -liberty /home/.../sky130_fd_sc_hd__tt_025C_1v80.lib

clean

write_verilog -noattr top_accelerator_netlist.v

proc; opt; fsm; opt;

show -format dot -prefix ./systolic_schematic

stat 
